app/controllers/administration/items_controller.rb

    def index
      @emails = User.emails_of_all_users
      @items = Item.all
---
SELECT "items".* FROM "items"

    def update
      @item.update(item_params)
      @item.has_discount = @item.discount_percentage.to_i.present?
      if @item.save
---
UPDATE "items" SET "discount_percentage" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["discount_percentage", 10], ["updated_at", "2019-04-08 23:41:18.463520"], ["id", 1]]
UPDATE "items" SET "has_discount" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["has_discount", true], ["updated_at", "2019-04-09 10:22:26.361787"], ["id", 2]]