app/models/item.rb

SELECT "items".* FROM "items"
---
  def self.average_price
    list = []

    all.select { |elem| list << elem.price }