app/models/user.rb

INSERT INTO "profiles" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 4], ["created_at", "2019-04-10 13:49:56.399076"], ["updated_at", "2019-04-10 13:49:56.399076"]]
---
  def create_profile
    Profile.create(user_id: id)

SELECT "users"."email" FROM "users"
---
  def self.emails_of_all_users
    User.pluck(:email)